Repository: liuzeyi11/GovernmentWorkReportCorpus
Catalog: government_report_tmx_file/GR2022.tmx
Source language: en_us
Languages: zh_cn

source: We must rally more closely around the CPC Central Committee with Comrade Xi Jinping at its core, hold high the banner of socialism with Chinese characteristics, and follow the guidance of Xi Jinping Thought on Socialism with Chinese Characteristics for a New Era.
zh_cn: 我们要更加紧密地团结在以习近平同志为核心的党中央周围，高举中国特色社会主义伟大旗帜，以习近平新时代中国特色社会主义思想为指导，

source: We will meet challenges squarely, forge ahead determinedly, work hard to fulfill this year's goals and tasks, set the stage for the 20th National Congress of the CPC with concrete actions, and continue working tirelessly to build our country into a great modern socialist country that is prosperous, strong, democratic, culturally advanced, harmonious, and beautiful, and to realize the Chinese Dream of national rejuvenation.
zh_cn: 攻坚克难，砥砺奋进，努力完成全年目标任务，以实际行动迎接党的二十大胜利召开，为把我国建设成为富强民主文明和谐美丽的社会主义现代化强国、实现中华民族伟大复兴的中国梦不懈奋斗！
